Revit 2027 API
ScheduleSheetInstance.ScheduleId Property
 Id of the primary schedule that generates this ScheduleInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ScheduleId { get; }
Public ReadOnly Property ScheduleId As ElementId
	Get
public:
property ElementId^ ScheduleId {
	ElementId^ get ();
}
member ScheduleId : ElementId with get
Property Value
ElementId
See Also
Reference
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace